In [4]:
"""
| id | name  |
| -- | ----- |
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

| id | customerId |
| -- | ---------- |
| 1  | 3          |
| 2  | 1          |
"""

import pandas as pd

customers = [
    {"id": 1, "name": "Joe"},
    {"id": 2, "name": "Henry"},
    {"id": 3, "name": "Sam"},
    {"id": 4, "name": "Max"},
]

orders = [
    {"id": 1, "customerId": 3},
    {"id": 2, "customerId": 1},
]

customers = pd.DataFrame(customers)
orders = pd.DataFrame(orders)


customers["id"].isin(orders["customerId"])

0     True
1    False
2     True
3    False
Name: id, dtype: bool

In [5]:
"""
Views table:
+------------+-----------+-----------+------------+
| article_id | author_id | viewer_id | view_date  |
+------------+-----------+-----------+------------+
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |
+------------+-----------+-----------+------------+
"""

views = [
    {"article_id": 1, "author_id": 3, "viewer_id": 5, "view_date": "2019-08-01"},
    {"article_id": 1, "author_id": 3, "viewer_id": 6, "view_date": "2019-08-02"},
    {"article_id": 2, "author_id": 7, "viewer_id": 7, "view_date": "2019-08-01"},
    {"article_id": 2, "author_id": 7, "viewer_id": 6, "view_date": "2019-08-02"},
    {"article_id": 4, "author_id": 7, "viewer_id": 1, "view_date": "2019-07-22"},
    {"article_id": 3, "author_id": 4, "viewer_id": 4, "view_date": "2019-07-21"},
    {"article_id": 3, "author_id": 4, "viewer_id": 4, "view_date": "2019-07-21"},
]

views = pd.DataFrame(views)

# Find the authors who viewed at least one of their own articles
df = views[views["author_id"] == views["viewer_id"]][["author_id"]].reset_index(
    drop=True
)
df.drop_duplicates(inplace=True)
df.sort_values("author_id", inplace=True)
df

   author_id
1          4
0          7

In [6]:
"""
| tweet_id | content                           |
| -------- | --------------------------------- |
| 1        | Let us Code                       |
| 2        | More than fifteen chars are here! |
"""

tweets = [
    {"tweet_id": 1, "content": "Let us Code"},
    {"tweet_id": 2, "content": "More than fifteen chars are here!"},
]

tweets = pd.DataFrame(tweets)

tweets[tweets["content"].str.len() > 15][["tweet_id"]]

   tweet_id
1         2

In [7]:
"""
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
"""

employees = [
    {"employee_id": 2, "name": "Meir", "salary": 3000},
    {"employee_id": 3, "name": "Michael", "salary": 3800},
    {"employee_id": 7, "name": "Addilyn", "salary": 7400},
    {"employee_id": 8, "name": "Juan", "salary": 6100},
    {"employee_id": 9, "name": "Kannon", "salary": 7700},
]

employees = pd.DataFrame(employees)

employees.apply(
    lambda x: (x["salary"] if x["employee_id"] % 2 != 0 and x["name"][0] != "M" else 0),
    axis=1,
)

0       0
1       0
2    7400
3       0
4    7700
dtype: int64

In [40]:
"""
Iput: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
"""

employees = [
    {"id": 1, "salary": 100},
    {"id": 2, "salary": 200},
    {"id": 3, "salary": 300},
]
df = pd.DataFrame(employees)

df.sort_values("salary", ascending=False).reset_index(drop=True)
N = 2

df.iloc[N - 1][["salary"]].to_frame()

          1
salary  200